Unidad 1/T1.1 SIN BD/TI1.1 SOAP_JAVA_CONUNI_GR01/02.CLIESC/build/classes/META-INF/wsdl/localhost_8080/WS_CONUNI_SOAPJAVA_GRO01/WS_Conversion_Unidades.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by XML-WS Runtime (https://github.com/eclipse-ee4j/metro-jax-ws). Runtime's version is Eclipse Metro/4.0.3.payara-p1 (metro-4.0.3.payara-maintenance-004e4e3; 2023-11-08T12:59:53+0000) XMLWS-Impl/4.0.2 XMLWS-API/4.0.1 XMLB-Impl/4.0.4 XMLB-API/4.0.1 git-revision#004e4e3. --><!-- Generated by XML-WS Runtime (https://github.com/eclipse-ee4j/metro-jax-ws). Runtime's version is Eclipse Metro/4.0.3.payara-p1 (metro-4.0.3.payara-maintenance-004e4e3; 2023-11-08T12:59:53+0000) XMLWS-Impl/4.0.2 XMLWS-API/4.0.1 XMLB-Impl/4.0.4 XMLB-API/4.0.1 git-revision#004e4e3. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://ws.monster.edu.ec/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://ws.monster.edu.ec/" name="WS_Conversion_Unidades">
<types>
<xsd:schema>
<xsd:import namespace="http://ws.monster.edu.ec/" schemaLocation="http://localhost:8080/WS_CONUNI_SOAPJAVA_GRO01/WS_Conversion_Unidades?xsd=1"/>
</xsd:schema>
</types>
<message name="pulgadasAcentimetros">
<part name="parameters" element="tns:pulgadasAcentimetros"/>
</message>
<message name="pulgadasAcentimetrosResponse">
<part name="parameters" element="tns:pulgadasAcentimetrosResponse"/>
</message>
<message name="login">
<part name="parameters" element="tns:login"/>
</message>
<message name="loginResponse">
<part name="parameters" element="tns:loginResponse"/>
</message>
<message name="fahrenheitAcelsius">
<part name="parameters" element="tns:fahrenheitAcelsius"/>
</message>
<message name="fahrenheitAcelsiusResponse">
<part name="parameters" element="tns:fahrenheitAcelsiusResponse"/>
</message>
<message name="kilogramosAlibras">
<part name="parameters" element="tns:kilogramosAlibras"/>
</message>
<message name="kilogramosAlibrasResponse">
<part name="parameters" element="tns:kilogramosAlibrasResponse"/>
</message>
<message name="gramosAonzas">
<part name="parameters" element="tns:gramosAonzas"/>
</message>
<message name="gramosAonzasResponse">
<part name="parameters" element="tns:gramosAonzasResponse"/>
</message>
<message name="librasAkilogramos">
<part name="parameters" element="tns:librasAkilogramos"/>
</message>
<message name="librasAkilogramosResponse">
<part name="parameters" element="tns:librasAkilogramosResponse"/>
</message>
<message name="metrosApies">
<part name="parameters" element="tns:metrosApies"/>
</message>
<message name="metrosApiesResponse">
<part name="parameters" element="tns:metrosApiesResponse"/>
</message>
<message name="celsiusAfahrenheit">
<part name="parameters" element="tns:celsiusAfahrenheit"/>
</message>
<message name="celsiusAfahrenheitResponse">
<part name="parameters" element="tns:celsiusAfahrenheitResponse"/>
</message>
<message name="celsiusAkelvin">
<part name="parameters" element="tns:celsiusAkelvin"/>
</message>
<message name="celsiusAkelvinResponse">
<part name="parameters" element="tns:celsiusAkelvinResponse"/>
</message>
<message name="kilometrosAmillas">
<part name="parameters" element="tns:kilometrosAmillas"/>
</message>
<message name="kilometrosAmillasResponse">
<part name="parameters" element="tns:kilometrosAmillasResponse"/>
</message>
<portType name="WS_Conversion_Unidades">
<operation name="pulgadasAcentimetros">
<input wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/pulgadasAcentimetrosRequest" message="tns:pulgadasAcentimetros"/>
<output wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/pulgadasAcentimetrosResponse" message="tns:pulgadasAcentimetrosResponse"/>
</operation>
<operation name="login">
<input wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/loginRequest" message="tns:login"/>
<output wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/loginResponse" message="tns:loginResponse"/>
</operation>
<operation name="fahrenheitAcelsius">
<input wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/fahrenheitAcelsiusRequest" message="tns:fahrenheitAcelsius"/>
<output wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/fahrenheitAcelsiusResponse" message="tns:fahrenheitAcelsiusResponse"/>
</operation>
<operation name="kilogramosAlibras">
<input wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/kilogramosAlibrasRequest" message="tns:kilogramosAlibras"/>
<output wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/kilogramosAlibrasResponse" message="tns:kilogramosAlibrasResponse"/>
</operation>
<operation name="gramosAonzas">
<input wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/gramosAonzasRequest" message="tns:gramosAonzas"/>
<output wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/gramosAonzasResponse" message="tns:gramosAonzasResponse"/>
</operation>
<operation name="librasAkilogramos">
<input wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/librasAkilogramosRequest" message="tns:librasAkilogramos"/>
<output wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/librasAkilogramosResponse" message="tns:librasAkilogramosResponse"/>
</operation>
<operation name="metrosApies">
<input wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/metrosApiesRequest" message="tns:metrosApies"/>
<output wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/metrosApiesResponse" message="tns:metrosApiesResponse"/>
</operation>
<operation name="celsiusAfahrenheit">
<input wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/celsiusAfahrenheitRequest" message="tns:celsiusAfahrenheit"/>
<output wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/celsiusAfahrenheitResponse" message="tns:celsiusAfahrenheitResponse"/>
</operation>
<operation name="celsiusAkelvin">
<input wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/celsiusAkelvinRequest" message="tns:celsiusAkelvin"/>
<output wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/celsiusAkelvinResponse" message="tns:celsiusAkelvinResponse"/>
</operation>
<operation name="kilometrosAmillas">
<input wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/kilometrosAmillasRequest" message="tns:kilometrosAmillas"/>
<output wsam:Action="http://ws.monster.edu.ec/WS_Conversion_Unidades/kilometrosAmillasResponse" message="tns:kilometrosAmillasResponse"/>
</operation>
</portType>
<binding name="WS_Conversion_UnidadesPortBinding" type="tns:WS_Conversion_Unidades">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="pulgadasAcentimetros">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="login">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="fahrenheitAcelsius">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="kilogramosAlibras">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="gramosAonzas">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="librasAkilogramos">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="metrosApies">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="celsiusAfahrenheit">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="celsiusAkelvin">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="kilometrosAmillas">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="WS_Conversion_Unidades">
<port name="WS_Conversion_UnidadesPort" binding="tns:WS_Conversion_UnidadesPortBinding">
<soap:address location="http://localhost:8080/WS_CONUNI_SOAPJAVA_GRO01/WS_Conversion_Unidades"/>
</port>
</service>
</definitions>